
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.app_insights_connection_string
  * module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * azurerm_application_insights.appinsights


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights must be replaced
-/+ resource "azurerm_application_insights" "appinsights" {
      ~ app_id                                = "3dcd692f-11d5-4581-86c1-3cd424d505fd" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat/providers/Microsoft.Insights/components/rpa-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ location                              = "westeurope" -> "uksouth" # forces replacement
        name                                  = "rpa-aat"
      - tags                                  = {} -> null
        # (9 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://rpa-aat.vault.azure.net/secrets/app-insights-connection-string/7428e80080d5480cb42ae303805747e3"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpa-aat/providers/Microsoft.KeyVault/vaults/rpa-aat|rpa-aat"
        name                       = "rpa-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":110,"Program":"tfcmt","SHA1":"","Vars":{}} -->